# **변수와 상수**


https://ko.javascript.info/variables



---

# 목차

- 변수의 개념
- 변수 활용
- 변수 선언시 주의사항
- 상수
- 변수명, 상수명 습관!
- 일반적인 관례
- 여러가지 명명법   

---
# 변수의 개념

변수는 컴퓨터 프로그래밍에서 아직 알려지지 않거나 어느 정도까지만 알려져 있는 양이나 정보에 대한 **상징적인 이름**이다.

컴퓨터 소스 코드에서의 변수 이름은 일반적으로 **데이터 저장 위치와 그 안의 내용물**과 관련되어 있으며 이러한 것들은 프로그램 실행 도중에 **변경** 될 수 있다.

---

**프로그래밍에서의 변수**는 수학에서 말하는 변수의 개념과 완전히 일치하지 않을 수도 있다. 

컴퓨터 변수의 값은 수학에서처럼 등식이나 공식의 필수적인 부분이 아니다. 

컴퓨터 환경에서 변수는 **반복적인 과정** 안에서  이용할 수도 있다. 이를테면 한 장소의 값을 할당한 뒤 어느 곳에서 사용한 다음 새로운 값으로 다시 할당하고 같은 방법으로  다시 사용할 수도 있다. 

---
컴퓨터 프로그래밍에서의 변수는 긴 이름이 자주 나오며, 어떻게 이용할 것인지에 대한 설명을 나타내는 반면 수학에서의 변수는 짧은 시간 동안 쓰이는 간결한, 한 두 개 문자 이름이다.

 컴파일러는 변수의 상징적인 이름을 데이터의 실제 위치로 치환해야 한다. 변수 값, 형, 위치는 일반적으로  고정된 채 유지되는 반면 위치에 저장되어 있는 데이터는 **프로그램 실행 도중 변경**될 수 있다.         


[WIKI](https://en.wikipedia.org/wiki/Variable)

---

****요약하자면****
>변수는 물건을 담아두는 상자.

>데이터를 저장할 수 있는 메모리 공간에 이름을 붙이는것.

>변수에 저장된 데이터 값은 실행 도중에 변경할 수 있다.
---


# 변수 활용



![width:1100px](https://github.com/topcow656/js_1st-week/blob/f84ec55a871819d597628d46d270e8410c650a95/1-1.PNG?raw=true)

위와 같은 코드가 있다고 합시다..

이 글에서 무수히 많은 박상우를 딱딱하다는 이유로 상우로 바꾸고 싶습니다. 이 글에서는 박상우가 4개 밖에 없지만 **극단적인 예시**를 생각해보면 1억개의 박상우가 있을 수 있습니다. 이럴 때 사용하는 것이 변수 입니다.

---

![width:1100px](https://github.com/topcow656/js_1st-week/blob/f84ec55a871819d597628d46d270e8410c650a95/2.PNG?raw=true)

위와 같은 방법으로 한번에 박상우를 상우로 **변수**를 이용하여 변경할 수 있습니다.

---


# 변수 선언시 주의할 점 #1
**같은 이름의 변수를 두번 선언하면 안된다.**


![width:1100px](https://github.com/topcow656/js_1st-week/blob/topcow656-patch-1/3.PNG?raw=true)

변수의 값을 변경하고 싶을 때 변수를 재선언하면 안됩니다,
새로운 변수를 만들고 싶을 때 변수명이 이전의 것과 중복되면 안됩니다.

---
# #2
**변수명 첫 글자엔 숫자가 올 수 없다.**

![width:1100px](https://github.com/topcow656/js_1st-week/blob/topcow656-patch-1/4.PNG?raw=true)

---
#  #3
**오직 문자, 숫자, 그리고 기호 $와 _만 들어갈 수 있다.**

![width:1100px](https://github.com/topcow656/js_1st-week/blob/topcow656-patch-1/5.PNG?raw=true)

---
# #4
**대 소문자 구별을 한다.**

![width:1100px](https://github.com/topcow656/js_1st-week/blob/topcow656-patch-1/6.PNG?raw=true)

---
# #5
**예약어는 사용할 수 없다.**

![width:1100px](https://github.com/topcow656/js_1st-week/blob/topcow656-patch-1/laung.PNG?raw=true)



---
# 상수

상수는 변하지 않는 변수로 선언할 때 let대신 const를 사용한다.

상수는 이름을 대문자로 하는 것이 일반적이다.

여러 단어로 구성된 경우 "_"를 사용한다.

Ex) AMOUNT, AMOUNT_NORMAL, COLOR_GREEN, AGE

기억하기 힘든 값을 상수로 선언하면 편리하다.







---

# 변수명, 상수명 습관 길들이기!

코딩은 효율성이 중요하다고 생각합니다.

자신이 6개월 전에 만든 코드를 보며 다시 분석하는건 시간 낭비라고 생각합니다.

어느 순간에 그 코드를 다시볼 때조차 알아볼 수 있게 변수명을 정하는 습관을 길러야 합니다!

---
# 일반적인 관례

1. 변수 이름은 사람이 읽을 수 있는 이름을 사용한다
2. 변수는 여러 단어로 구성되더라도 "_"를 사용하지 않고 두번째 단어 첫글자를 대문자로 한다.
3. 최대한 서술적이고 간결하게 명명한다.
4. 한 문자만으로 구성된 경우는 피한다.( a, b, x)

---
# 여러가지 명명법

**낙타 표기법**

두 단어 이상의 변수명을 표현할 때 두 번째 단어부터 첫 글자를 대문자로 표기하는 방법.

ex) ourPlantName, myName

**파스칼표기법**
첫 글자를 대문자로 구성하며 단어가 합성될 때 마다 각 단어의 첫 글자를 대문자로 표기하는 방식

ex) MainTitle, UserStatus

---
**언더스코어 표기법**

주로 데이터베이스 쪽이나 자바스크립트 쪽에서 지역 변수를 사용할 경우에 언더바를 사용하는 표기법을 사용한다.

ex) content_name, user_data

**헝가리언 표기법**

마이크로 소프트사의 프로그래머가 코딩할 때 습관적으로 즐겨쓰던 접두어 변수 명명 방식이 빌게이츠의 눈에 띄어 표준화(일반화)된 것이라 한다. 변수를 표기할 떄 앞에 접두어로 쉽게 알아볼 수 있도록 표기하였는데 이를 통해 자료형을 쉽게 알아볼 수 있다.

ex) int nNum, float fNum, argument of String-> args
